RSN/src/InformationRegisters/ЗаявкиНаСогласовании/ЗаявкиНаСогласовании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаявкиНаСогласовании</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </attributes>
  <attributes>
    <name>Гуид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>CatalogRef.ЗаявкиНаПредоставлениеДоступа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/ЗаявкиНаСогласовании/ManagerModule.bsl
#Область Интерфейс   
Функция ПолучитьЗаявкиНаСогласовании() Экспорт  
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаСогласованииСрезПоследних.Заявка КАК Заявка,
	               |	ЗаявкиНаСогласованииСрезПоследних.Состояние КАК Состояние,
	               |	ЗаявкиНаСогласованииСрезПоследних.Письмо КАК Письмо,
	               |	ЗаявкиНаСогласованииСрезПоследних.Гуид КАК Гуид
	               |ИЗ
	               |	РегистрСведений.ЗаявкиНаСогласовании.СрезПоследних КАК ЗаявкиНаСогласованииСрезПоследних
	               |ГДЕ
	               |	ЗаявкиНаСогласованииСрезПоследних.Состояние = 0";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ОтправитьНаСогласование(Заявки) Экспорт
	Ответ 		 = Новый Структура("Результат, ОписаниеОшибки, ЕстьОшибка", Ложь, "", Ложь);	
	МассивОшибок = Новый Массив;
	
	Если ТипЗнч(Заявки) = Тип("Массив") Тогда 
		МассивЗаявки = Заявки;
	Иначе 
		МассивЗаявки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Заявки);
	КонецЕсли;           
	
	ТД = ТекущаяДата();
	
	Для Каждого Эл Из МассивЗаявки Цикл 
		Мз = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Мз, Эл);
		Мз.Период = ТД; 
		
		//Мз.Заявка = Эл.Заявка;
		//Мз.Письмо = Эл.Письмо;
		МЗ.Состояние = 0;//отправлено на согласование  
		Попытка 
			Мз.Записать(Истина); 
		Исключение
			МассивОшибок.Добавить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивОшибок) Тогда 
		Ответ.ЕстьОшибка = Истина;
		Ответ.ОписаниеОшибки = СтрСоединить(МассивОшибок,Символы.ПС);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ОтменитьСогласование(Заявки) Экспорт  
	Ответ 		 = Новый Структура("Результат, ОписаниеОшибки, ЕстьОшибка", Ложь, "", Ложь);	
	МассивОшибок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаСогласованииСрезПоследних.Заявка КАК Заявка
	               |ИЗ
	               |	РегистрСведений.ЗаявкиНаСогласовании.СрезПоследних(, Заявка в (&Заявка)) КАК ЗаявкиНаСогласованииСрезПоследних";
	Запрос.УстановитьПараметр("Заявка", Заявки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Тд = ТекущаяДата();
	Пока Выборка.Следующий() Цикл 
		МЗ = СоздатьМенеджерЗаписи();
		МЗ.Период 		= Тд;
		МЗ.Заявка 		= Выборка.Заявка;
		МЗ.Состояние 	= 2;//отменено
		Попытка
			Мз.Записать(Истина);
		Исключение
			МассивОшибок.Добавить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивОшибок) Тогда 
		Ответ.ЕстьОшибка = Истина;
		Ответ.ОписаниеОшибки = СтрСоединить(МассивОшибок,Символы.ПС);
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции

Функция ЗавершитьСогласование(Заявки) Экспорт
	Ответ 		 = Новый Структура("Результат, ОписаниеОшибки, ЕстьОшибка", Ложь, "", Ложь);	
	МассивОшибок = Новый Массив;
	
	Если ТипЗнч(Заявки) = Тип("Массив") Тогда 
		МассивЗаявки = Заявки;
	Иначе 
		МассивЗаявки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Заявки);
	КонецЕсли;           
	
	ТД = ТекущаяДата();
	
	Для Каждого Эл Из МассивЗаявки Цикл 
		Мз = СоздатьМенеджерЗаписи();
		Мз.Период = ТД;
		Мз.Заявка = Эл.Заявка;
		Мз.Письмо = Эл.Письмо;
		МЗ.Состояние = 1;//отправлено на согласование  
		Попытка 
			Мз.Записать(Истина); 
		Исключение
			МассивОшибок.Добавить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивОшибок) Тогда 
		Ответ.ЕстьОшибка = Истина;
		Ответ.ОписаниеОшибки = СтрСоединить(МассивОшибок,Символы.ПС);
	КонецЕсли;
	Возврат Ответ;
	//
	//ТЗ_Статусы = ПроверитьЗаявки(МассивЗаявки); 
	//
	//ОписаниеПисем = Справочники.ЗаявкиНаПредоставлениеДоступа.ПолучитьДанныеДляПисьма(ТЗ_Статусы.ВыгрузитьКолонку("Заявка"));
КонецФункции

Функция ПроверитьЗаявки(МассивЗаявки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаПредоставлениеДоступа.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Вт
	               |ИЗ
	               |	Справочник.ЗаявкиНаПредоставлениеДоступа КАК ЗаявкиНаПредоставлениеДоступа
	               |ГДЕ
	               |	ЗаявкиНаПредоставлениеДоступа.Ссылка В(&Заявки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ЗаявкиНаСогласованииСрезПоследних.Состояние, 0) КАК Состояние,
	               |	Вт.Ссылка КАК Заявка,
	               |	ЗаявкиНаСогласованииСрезПоследних.Период КАК Период,
	               |	ЗаявкиНаСогласованииСрезПоследних.Информация КАК Информация
	               |ИЗ
	               |	Вт КАК Вт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиНаСогласовании.СрезПоследних(, ) КАК ЗаявкиНаСогласованииСрезПоследних
	               |		ПО Вт.Ссылка = ЗаявкиНаСогласованииСрезПоследних.Заявка";
	Запрос.УстановитьПараметр("Заявки", МассивЗаявки);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти
